{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Реализуйте программу, которая будет эмулировать работу с пространствами имен. Необходимо реализовать поддержку создания пространств имен и добавление в них переменных.\n",
    "\n",
    "В данной задаче у каждого пространства имен есть уникальный текстовый идентификатор – его имя.\n",
    "\n",
    "Вашей программе на вход подаются следующие запросы:\n",
    "\n",
    "create <namespace> <parent> –  создать новое пространство имен с именем <namespace> внутри пространства <parent>\n",
    "add <namespace> <var> – добавить в пространство <namespace> переменную <var>\n",
    "get <namespace> <var> – получить имя пространства, из которого будет взята переменная <var> при запросе из пространства <namespace>, или None, если такого пространства не существует\n",
    "Рассмотрим набор запросов\n",
    "\n",
    "add global a\n",
    "create foo global\n",
    "add foo b\n",
    "create bar foo\n",
    "add bar a\n",
    "Структура пространств имен описанная данными запросами будет эквивалентна структуре пространств имен, созданной при выполнении данного кода\n",
    "\n",
    "a = 0\n",
    "def foo():\n",
    "  b = 1\n",
    "  def bar():\n",
    "    a = 2\n",
    "В основном теле программы мы объявляем переменную a, тем самым добавляя ее в пространство global. Далее мы объявляем функцию foo, что влечет за собой создание локального для нее пространства имен внутри пространства global. В нашем случае, это описывается командой create foo global. Далее мы объявляем внутри функции foo функцию bar, тем самым создавая пространство bar внутри пространства foo, и добавляем в bar переменную a.\n",
    "\n",
    "Добавим запросы get к нашим запросам\n",
    "\n",
    "get foo a\n",
    "get foo c\n",
    "get bar a\n",
    "get bar b\n",
    "Представим как это могло бы выглядеть в коде\n",
    "\n",
    "a = 0\n",
    "def foo():\n",
    "  b = 1\n",
    "  get(a)\n",
    "  get(c)\n",
    "  def bar():\n",
    "    a = 2\n",
    "    get(a)\n",
    "    get(b)\n",
    "Результатом запроса get будет имя пространства, из которого будет взята нужная переменная.\n",
    "Например, результатом запроса get foo a будет global, потому что в пространстве foo не объявлена переменная a, но в пространстве global, внутри которого находится пространство foo, она объявлена. Аналогично, результатом запроса get bar b будет являться foo, а результатом работы get bar a будет являться bar.\n",
    "\n",
    "Результатом get foo c будет являться None, потому что ни в пространстве foo, ни в его внешнем пространстве global не была объявлена переменная с.\n",
    "\n",
    "Более формально, результатом работы get <namespace> <var> является\n",
    "\n",
    "<namespace>, если в пространстве <namespace> была объявлена переменная <var>\n",
    "get <parent> <var> – результат запроса к пространству, внутри которого было создано пространство <namespace>, если переменная не была объявлена\n",
    "None, если не существует <parent>, т. е. <namespace>﻿ – это global\n",
    "Формат входных данных\n",
    "В первой строке дано число n (1 ≤ n ≤ 100) – число запросов.\n",
    "В каждой из следующих n строк дано по одному запросу.\n",
    "Запросы выполняются в порядке, в котором они даны во входных данных.\n",
    "Имена пространства имен и имена переменных представляют из себя строки длины не более 10, состоящие из строчных латинских букв.\n",
    "\n",
    "Формат выходных данных\n",
    "Для каждого запроса get выведите в отдельной строке его результат.\n",
    "\n",
    "\n",
    "\n",
    "Sample Input:\n",
    "\n",
    "9\n",
    "add global a\n",
    "create foo global\n",
    "add foo b\n",
    "get foo a\n",
    "get foo c\n",
    "create bar foo\n",
    "add bar a\n",
    "get bar a\n",
    "get bar b\n",
    "Sample Output:\n",
    "\n",
    "global\n",
    "None\n",
    "bar\n",
    "foo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "9\n",
      "add global a\n",
      "create foo global\n",
      "add foo b\n",
      "get foo a\n",
      "global\n",
      "get foo c\n",
      "None\n",
      "create bar foo\n",
      "add bar a\n",
      "get bar a\n",
      "bar\n",
      "get bar b\n",
      "foo\n"
     ]
    }
   ],
   "source": [
    "global_namespace = {}\n",
    "\n",
    "def create(namespace, parent):\n",
    "    new_namespace = { '_parent': parent }\n",
    "    global_namespace[namespace] = new_namespace\n",
    "    \n",
    "def add(namespace, var):\n",
    "    ns = global_namespace if namespace == 'global' else global_namespace[namespace]\n",
    "    ns[var] = 1\n",
    "    \n",
    "def get(namespace, var):\n",
    "    ns = global_namespace if namespace == 'global' else global_namespace[namespace]\n",
    "    if var in ns:\n",
    "        return namespace\n",
    "    if var not in ns and '_parent' not in ns:\n",
    "        return None\n",
    "    return get(ns['_parent'], var)\n",
    "\n",
    "def get_print(namespace, var):\n",
    "    print(get(namespace, var))\n",
    "\n",
    "cmd = {\n",
    "    'create': create,\n",
    "    'add': add,\n",
    "    'get': get_print\n",
    "}\n",
    "\n",
    "for i in range(0, int(input())):\n",
    "    cmd_name, ns_name, var_name = input().split(' ')\n",
    "    cmd[cmd_name](ns_name, var_name)\n",
    "    \n",
    "    \n",
    "# nam = {'global': {'par': None, 'vrs': set()}}\n",
    "\n",
    "# for x in [input().split() for cmd in range(int(input()))]:\n",
    "#     if x[0] == 'create':\n",
    "#         nam[x[1]] = {'par': x[2], 'vrs': set()}\n",
    "#     elif x[0] == 'add':\n",
    "#         nam[x[1]]['vrs'].add(x[2])\n",
    "#     elif x[0] == 'get':\n",
    "#         get = lambda n, v: v in nam[n]['vrs'] and n or n == 'global' and 'None' or get(nam[n]['par'], v)\n",
    "#         print(get(x[1], x[2]))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
